app/services/task_mapper_service.rb

  def process_day_one(responses)
    pref = @user.career_preference || @user.build_career_preference

    pref.assign_attributes(
      target_titles:            responses["target_titles"] || [],
      target_salary_min:        responses.dig("salary", "min"),
      target_salary_ideal:      responses.dig("salary", "ideal"),
      work_location_preference: responses["work_location"],
      max_commute_minutes:      responses["max_commute"],
      must_have_skills:         responses["must_have_skills"] || [],
      nice_to_have_skills:      responses["nice_to_have_skills"] || [],
      non_negotiables:          responses["non_negotiables"] || [],
      role_must_include:        responses["role_must_include"],
      career_summary:           responses["career_summary"]
    )

    pref.save!
---
INSERT INTO "career_preferences" ("user_id", "target_salary_min", "target_salary_ideal", "work_location_preference", "max_commute_minutes", "role_must_include", "career_summary", "created_at", "updated_at", "target_titles", "must_have_skills", "nice_to_have_skills", "non_negotiables") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
UPDATE "career_preferences" SET "target_salary_min" = $1, "target_salary_ideal" = $2, "work_location_preference" = $3, "max_commute_minutes" = $4, "role_must_include" = $5, "career_summary" = $6, "updated_at" = $7, "target_titles" = $8, "must_have_skills" = $9, "nice_to_have_skills" = $10, "non_negotiables" = $11 WHERE "career_preferences"."id" = $12

  def process_day_two(responses)
    weights = responses["weights"]
    jobs    = responses["jobs"]

    raise "Missing weights" unless weights.present?
    raise "Missing jobs array" unless jobs.is_a?(Array)

    saved_jobs = jobs.map do |job|
      new_job = @user.job_leads.create!(
        job_title: job["job_title"],
        company: job["company"],
        url: job["url"],
        known_connections: job["known_connections"] || [],
        checks: job["checks"] || {},
        match_score: calculate_match_score(weights, job["checks"])
      )
---
INSERT INTO "job_leads" ("user_id", "job_title", "company", "url", "known_connections", "checks", "match_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"