app/controllers/api/v1/plan_days_controller.rb

      def create
        plan_day = current_user.plan_days.create(plan_day_params)
---
INSERT INTO "plan_days" ("day_number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["day_number", 1], ["user_id", 2], ["created_at", "2025-12-08 02:45:33.173887"], ["updated_at", "2025-12-08 02:45:33.173887"]]