app/controllers/api/v1/plan_tasks_controller.rb

    task = PlanTask.joins(:plan_day)
                   .where(plan_days: { user_id: current_user.id })
                   .find(params[:id])
---
SELECT "plan_tasks".* FROM "plan_tasks" INNER JOIN "plan_days" ON "plan_days"."id" = "plan_tasks"."plan_day_id" WHERE "plan_days"."user_id" = $1 AND "plan_tasks"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 114], ["LIMIT", 1]]