app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save